Doom/README.org
#+TITLE: 3macS3c Doom Config
#+AUTHOR: 3macS3c
#+DESCRIPTION:
#+auto_tangle: t
#+STARTUP: showeverything

* TABLE OF CONTENTS :TOC:
:PROPERTIES:
:ID:       000a9879-f073-45f6-9018-8955d7976c03
:END:
- [[#literate-config][Literate Config:]]
- [[#doom-main-config][Doom Main Config:]]
  - [[#general-settings][General Settings:]]
  - [[#revert][Revert:]]
  - [[#org-mode][ORG MODE:]]
  - [[#markdown][Markdown:]]
  - [[#quality-of-life][Quality Of Life:]]
- [[#packagesel][packages.el:]]
- [[#initel][init.el]]

* Literate Config:
:PROPERTIES:
:ID:       8b109ffb-1a46-464f-b168-4d5efac2f955
:END:
* Doom Main Config:
:PROPERTIES:
:ID:       361a35c9-3eac-47ec-af51-ad90d4d8c2f1
:header-args: :tangle ~/Dropbox/40-49_Career/45-KaliShared/45.00-KaliConfigs/Doom/config.el
:END:


** General Settings:
:PROPERTIES:
:ID:       a17ee53a-a4ba-42cd-b41d-cabfff9a266f
:END:
*** User Information:
:PROPERTIES:
:ID:       a2bd54eb-f25d-446b-8c5a-a4fb3c2199a0
:END:
#+begin_src emacs-lisp
(setq user-full-name "3macS3c")
#+end_src

*** Set Theme and line Numbers:
:PROPERTIES:
:ID:       79e6107b-75f2-45cc-b02e-40095f35b917
:END:
#+begin_src emacs-lisp
;;Select my preffered theme:
(setq doom-theme 'doom-dracula)
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src
*** Beacon:
:PROPERTIES:
:ID:       29622efc-52c7-4b7a-beaa-edbb1363e065
:END:
Never lose your cursor.  When you scroll, your cursor will shine!  This is a global minor-mode. Turn it on everywhere with:

#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src
*** Graphics: Pixel-precision scrolling:
:PROPERTIES:
:ID:       db383e18-c11a-4111-aa55-6aa95f21771d
:END:
#+begin_src emacs-lisp
(when (version< "29.0.50" emacs-version)
  (pixel-scroll-precision-mode))
#+end_src
** Revert:
:PROPERTIES:
:ID:       46b0191d-6a14-43e0-a459-b125dab67b7a
:END:
Doom Emacs uses 'SPC b' for keybindings related to bookmarks and buffers.

*** Global Auto Revert
:PROPERTIES:
:ID:       f2f913de-6630-41fa-98a6-161c56929db5
:END:
A buffer can get out of sync with respect to its visited file on disk if that file is changed by another program. To keep it up to date, you can enable Auto Revert mode by typing M-x auto-revert-mode, or you can set it to be turned on globally with 'global-auto-revert-mode'.  I have also turned on Global Auto Revert on non-file buffers, which is especially useful for 'dired' buffers.

#+begin_src emacs-lisp
;;Global Auto Revert
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** ORG MODE:
:PROPERTIES:
:ID:       a9a32dc9-eaa0-4866-9cc0-5573061c5ec1
:END:
- This is where the vast majority of my customization lies. As I live mostly in ORG Mode.
*** ORG - Todo States:
:PROPERTIES:
:ID:       b5055bad-0e4b-46c8-b728-f32400488f6c
:END:
Custom TODO states & Tags
#+begin_src emacs-lisp
;; CUSTOM org TODO states
(after! org
(setq org-todo-keywords
      '((sequence "TODO(t)"
         "NEXT(n)"
         "PLANNING(p)"
         "IN-PROGRESS(i)"
         "WEEKLY-GOAL(m)"
         "GOAL(g)"
         "WAITING(w)"
         "WORK(b)"
         "HABIT(h)"
         "PROJECT(P)"
         "CALENDAR(c)"
         "NOTE(N)"
         "AREA(a)"
         "|"
         "DONE(d!)"
         "COMPLETE(C!)"
         "HOLD(h)"
         "SOMEDAY(s)"
         "RABBITHOLE!(R)")
        )))

;; CUSTOM TODO colors
(after! org
(setq org-todo-keyword-faces
      '(
        ("TODO" . (:foreground "#ffdd83" :weight bold))
        ("NEXT" . (:foreground "light coral" :weight bold))
        ("PLANNING" . (:foreground "#bd7091" :weight bold))
        ("IN-PROGRESS" . (:foreground "#ffb86c" :weight bold))
        ("WEEKLY-GOAL" . (:foreground "light sea green" :weight bold))
        ("GOAL" . (:foreground "LimeGreen" :weight bold))
        ("WAITING" . (:foreground "LightPink1" :weight bold))
        ("WORK" . (:foreground "Cyan" :weight bold))
        ("HABIT" . (:foreground "RoyalBlue3" :weight bold))
        ("PROJECT" . (:foreground "SlateBlue1" :weight bold))
        ("CALENDAR" . (:foreground "chocolate" :weight bold))
        ("NOTE" . (:foreground "#7d9dc0" :background "#ffb86c" :weight bold))
        ("AREA" . (:foreground "#7d9dc0" :weight bold))

        ("DONE" . (:foreground "white" :weight bold))
        ("COMPLETE" . (:strikethrough t :foreground "light gray" :weight bold))
        ("HOLD" . (:foreground "Grey46" :weight bold))
        ("SOMEDAY" . (:foreground "cyan1" :weight bold))
        )))

;; Custom Tag colors
(setq org-tag-faces
      '(
        ("planning"  . (:foreground "mediumPurple1" :weight bold))
        ("@research"   . (:foreground "royalblue1"    :weight bold))
        ("QA"        . (:foreground "sienna"        :weight bold))
        ("CRITICAL"  . (:foreground "red1"          :weight bold))
        ("HABIT"  . (:foreground "pink"          :weight bold))
        )
      )
#+end_src

*** ORG - CRYPT Setup:
:PROPERTIES:
:ID:       b0172336-1c78-43ba-9d4d-328ea1cb2bec
:END:

#+begin_src emacs-lisp
;;;;;;;;;;;;;;;;;;;;;ORG CRYPT
;; ORG CRYPT TAG Setup for inline encryption
;; If I place "crypt" tag in any entry it will encrypt it.
(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance '("crypt"))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)
;; Set shortut to decrypt easier.
(map! :leader
      :desc "Org Decrypt Entry"
      "d e" #'org-decrypt-entry)
#+end_src

*** ORG - Center Screen Shortcut:
:PROPERTIES:
:ID:       c7ff47ea-c1e2-494b-93b8-c8a161e0d8e6
:END:
- Easily recenter the screen my hitting leader + s + c
#+begin_src emacs-lisp
(map! :leader
      :desc "recenter-top-bottom"
      "s c" #'recenter-top-bottom)
#+end_src

*** ORG - Preview Images in all files:
:PROPERTIES:
:ID:       e7a190f3-2341-449b-863e-ecbd8d5193d9
:END:
#+begin_src emacs-lisp
;; Preview images in all org files on launch
(setq org-startup-with-inline-images t)
;;Adjust images to an actual size that doesn't take up the entire screen.
(setq org-image-actual-width 600)

#+end_src

*** ORG - Auto Tangle:
:PROPERTIES:
:ID:       e68426f3-10d3-40ab-ace9-43aea005726f
:END:

- By adding this ~#+PROPERTY: header-args :tangle /Directory/name_of_file.extension~ to any org file I can output the code block contents to the specified location.

#+begin_src emacs-lisp

;; Enables auto tangling/exporting of code blocks to a unified code file form org mode.
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

#+end_src

*** ORG - Start all documents in overview mode:
:PROPERTIES:
:ID:       907ee898-45d6-49e4-90c4-c47299ee4ee0
:END:
- I have large org files with lots of nested headings, this makes it less cumbersome.
#+begin_src emacs-lisp
(setq org-startup-folded t)

#+end_src

*** ORG - Add ID to all ORG headindgs on save:
:PROPERTIES:
:ID:       e34a8157-fadf-462e-bdd5-b66eb4f4e790
:END:
- Add ID to all ORG headindgs on save:
  - I want the option to be able to import org roam if need be. This adds ID's to all headings so I can then easily back link.
#+begin_src emacs-lisp
(add-hook 'org-capture-prepare-finalize-hook 'org-id-get-create)
(defun my/org-add-ids-to-headlines-in-file ()
;  "Add ID properties to all headlines in the current file which
;do not already have one."
  (interactive)
  (org-map-entries 'org-id-get-create))
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'before-save-hook 'my/org-add-ids-to-headlines-in-file nil 'local)))
#+end_src

*** ORG - Cosmetics:
:PROPERTIES:
:ID:       35aafda0-1f9c-4551-a4c8-79920bb74ac9
:END:
**** Cosmetics - Export with smart quotes:
:PROPERTIES:
:ID:       6cebe70b-2675-4d0f-b996-76e98c1eff69
:END:
- I use custom smart quotes so this helps me have them remain when exporting.
#+begin_src emacs-lisp
;; Export using my custom smart quotes.
(setq org-export-with-smart-quotes t)
#+end_src

**** Cosmetics - Hide Emphasis Markers:
:PROPERTIES:
:ID:       d50728fa-59ad-43fd-b305-3cd36934c7ea
:END:
- This means that the markers used for emphasis will no longer be visible and instead just the outcome.

#+begin_src emacs-lisp

;; Hide emphasis markers in text this means that MD and org syntax icons will not show
;; effectively acts as preview.

(after! org
(setq org-hide-emphasis-markers t))

#+end_src

**** Cosmetics - Colour Configuration:
:PROPERTIES:
:ID:       e3d89ffa-f86c-4810-917e-fc0e9dff2c78
:END:
#+begin_src emacs-lisp

;;Customize ORG higlighting
;; this controls the color of bold, italic, underline, verbatim, strikethrough

(after! org
(setq org-emphasis-alist
    ;; Purple Bold & Underline Brighter purple
  '(("*" (underline :weight black :foreground "#A061F9" ))
    ;; Red text highligted in yellow (important)
    ("/" (:weight black :background "#FF5555" :foreground "#F1FA8C" ))
    ;; Blue
    ("_" (:weight black :foreground "#79c6ff" ))
    ;;Higlighter  brighter yellow
    ("=" (underline :weight black :foreground "#F1FA8C" ))
    ;; Code block
    ("~" (:background "#6BB86B" :foreground "#575a71" ))
    ;; Red = Important red
    ("+" (underline bold :weight italic :foreground "#FF5555" )))))
    ;;("+" (bold :strike-through nil :foreground "#ffb86c" #cd5c5c )))))

#+end_src

**** Cosmetics - Headline Bullets and Folds:
:PROPERTIES:
:ID:       c6d4de16-3f32-4289-8afe-938621ca352f
:END:
#+begin_src emacs-lisp
(setq org-superstar-headline-bullets-list '("› "))
#+end_src
**** Cosmetics - Item Bullets:
:PROPERTIES:
:ID:       a1bb5e48-0a40-4830-9606-5d6579e79fe1
:END:
- Custom bulleted list
#+begin_src emacs-lisp

(setq org-superstar-item-bullet-alist '((?* . ?⋆)
                                        (?+ . ?‣)
                                        (?- . ?•)))
#+end_src
**** Cosmetics - Dropdown Icon:
:PROPERTIES:
:ID:       470a4470-638e-4988-ab34-43f2edce07bc
:END:
- Custom drop down icon.
#+begin_src emacs-lisp
(setq org-ellipsis " ⯯")
#+end_src

